Revit 2027 API
PaperSourceSet.Contains Method
Tests for the existence of an item within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	PaperSource item
)
Public Overridable Function Contains (
	item As PaperSource
) As Boolean
public:
virtual bool Contains(
	PaperSource^ item
)
abstract Contains :
        item : PaperSource -> bool
override Contains :
        item : PaperSource -> bool
Parameters
item PaperSource
The item to be searched for.
Return Value
Boolean
The Contains method returns True if the item is within the set, otherwise False.
See Also
Reference
PaperSourceSet Class
Autodesk.Revit.DB Namespace